import random #Подключение в PyCharm модуля random, позволяющего генерировать случайные числа
# random.seed(123)#случайный метод генерации одних и тех же случайных чисел
# ф=random.random()#присвоение переменной команды для возвращения псевдослучайного вещественного числа от 0.0 до 1.0
# print(ф)#вывод этого числа
# print(ф)#вывод того же случайного числа
# print(random.triangular())
# str_='Hello World'#инициализация переменной типа данных строка
# a=random.random()#возвращение псевдослучайного вещественного числа от 0.0 до 1.0
# b=random.uniform(10,100)#возвращение псевдослучайного вещественного числа в диапазоне от 10 до 100
# c=random.randint(1,100)#возвращение псевдослучайного целого числа в диапазоне от 1 до 100
# r=random.choice(str_)#возвращение случайного элемента строки. Строка соответствует переменной str_
# print(a,', ',b,', ',c,', ',r)#вывод результата выполнения программы в одну строку через запятую
a=random.seed(123)
b=random.random()
print(random.random())
print(random.random())
# print(b)
# # print(random.random())
# # print(random.random())
# a
# b=random.random()
# print(b)